# GetAllSizeTableNames Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableManager..::..GetAllSizeTableNames Method
FamilySizeTableManager Class See Also
---
Get the FamilySizeTable names in a family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<string> GetAllSizeTableNames()
```

Visual Basic
---
```text
Public Function GetAllSizeTableNames As IList(Of String)
```

Visual C++
---
```text
public:
IList<String^>^ GetAllSizeTableNames()
```

# ### Return Value
Array of size table names.
# See Also
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace